import PageLayout from "@/components/PageLayout";
import type { Metadata } from "next";
import { treatmentSubMenu } from "../constants";

export const metadata: Metadata = {
  title: "מ.י.ת.ר - טיפול קבוצתי",
  description: "טיפול קבוצתי במ.י.ת.ר - המכון הישראלי לתראפיות",
};

export default function GroupTherapyPage() {
  return (
    <PageLayout title="טיפול קבוצתי" subMenuItems={treatmentSubMenu}>
      <p className="mb-2">
        טיפול קבוצתי או פסיכותיראפיה קבוצתית הוא שיטת טיפול בה מטפל אחד או
        יותר מטפלים בקבוצה קטנה של מטופלים יחדיו, כקבוצה מודרכת. המושג טיפול
        קבוצתי מתייחס לכל סוגי הטיפול הניתנים בפורמט קבוצתי, לרבות טיפול
        קוגניטיבי-התנהגותי, טיפול פסיכודינמי, טיפול בהבעה ויצירה ועוד.
      </p>
      <p className="mb-2">
        הטיפול הקבוצתי מנצל את הדינמיקה הקבוצתית ואת יחסי הגומלין בין חברי
        הקבוצה ככלי טיפולי מרכזי. חברי הקבוצה מספקים זה לזה תמיכה, משוב והזדמנות
        לתרגול של מיומנויות בין-אישיות במסגרת מוגנת ומלווה מקצועית. הקבוצה מהווה
        מיקרוקוסמוס חברתי שבו חברי הקבוצה יכולים לזהות דפוסים ביחסים הבין-אישיים
        שלהם ולפתח דרכי התייחסות חדשות.
      </p>
      <p className="mb-2">
        במובן הרחב יותר, המושג טיפול קבוצתי כולל גם קבוצות תמיכה, קבוצות לפיתוח
        מיומנויות, קבוצות פסיכו-חינוכיות וקבוצות צמיחה אישית. קבוצות אלו מתקיימות
        בהקשרים מגוונים ופונות לאוכלוסיות שונות, כגון ילדים, מתבגרים, מבוגרים,
        הורים, זוגות ועוד.
      </p>
    </PageLayout>
  );
}
