import PageLayout from "@/components/PageLayout";
import type { Metadata } from "next";
import { treatmentSubMenu } from "../constants";

export const metadata: Metadata = {
  title: "מ.י.ת.ר - טיפול משפחתי",
  description: "טיפול משפחתי במ.י.ת.ר - המכון הישראלי לתראפיות",
};

export default function FamilyTherapyPage() {
  return (
    <PageLayout title="טיפול משפחתי" subMenuItems={treatmentSubMenu}>
      <p className="mb-2">
        טיפול משפחתי, הידוע גם כטיפול זוגי ומשפחתי או טיפול משפחתי מערכתי, הוא
        ענף בפסיכותיראפיה שנועד לעבוד עם משפחות ובני זוג שמצויים במערכת יחסים,
        במטרה ליצור שינוי או התפתחות ביחסים. גישה זו נוטה לראות שינוי במונחים של
        מערכות יחסי גומלין בין חברי המשפחה. היא מדגישה יחסים משפחתיים כגורם
        מרכזי בבריאותו הנפשית של האדם.
      </p>
      <p className="mb-2">
        המשותף למרבית האסכולות של הטיפול המשפחתי, הוא האמונה כי מעורבות המשפחה
        בהתמודדות ובפתרונות לקשיים ולבעיות היא מועילה ביותר, וזאת גם אם מקור
        הבעיה מיוחס רק לאחד מחברי המשפחה ונתפס כבעיה אישית שלו. מעורבות זו של
        המשפחה מושגת לרוב באמצעות השתתפות ישירה של כל חברה או חלקם בפגישות
        הטיפוליות. הטיפול המשפחתי משמש לטיפול בטווח נרחב של בעיות ודילמות אנושיות
        בגילאים שונים.
      </p>
    </PageLayout>
  );
}
