import PageLayout from "@/components/PageLayout";
import type { Metadata } from "next";
import { treatmentSubMenu } from "./constants";

export const metadata: Metadata = {
  title: "תחומי הטיפול במכון מ.י.ת.ר",
  description:
    "תחומי הטיפול במכון מ.י.ת.ר. - טיפול בהבעה ויצירה, טיפול ריגשי, טיפול משפחתי, טיפול פרא-רפואי התפתחותי בילדים",
};

export default function TreatmentsPage() {
  return (
    <PageLayout title="תחומי הטיפול במכון" subMenuItems={treatmentSubMenu}>
      <ul className="list-square mr-5 mb-3">
        <li className="mb-2">
          טיפול רגשי במבוגרים וילדים - פסיכותיראפיה פרטנית, זוגית, משפחתית,
          דיאדית וקבוצתית ע&quot;י מגוון אנשי מקצוע מתחום בריאות הנפש:
          פסיכולוגים, עובדים סוציאליים - פסיכותיראפיסטים ותיראפיסטים באמצעות
          יצירה והבעה.
        </li>
        <li className="mb-2">אבחון פסיכולוגי לילדים.</li>
        <li className="mb-2">
          הדרכת הורים: במקביל לטיפול הריגשי בילדים ובמתבגרים.
        </li>
        <li className="mb-2">
          טיפולים בהבעה ויצירה (אומנות, דרמה, תנועה, ביבליותרפיה).
        </li>
        <li className="mb-2">
          תחומי טיפול נוספים בתחום הרגישי (פסיכותיראפיה, טיפול במשחק, טיפול
          דיאדי, טיפול משפחתי, טיפול קבוצתי).
        </li>
        <li className="mb-2">
          ריפוי בעיסוק התפתחותי לילדים: אבחון וטיפול בקשיים התפתחותיים בתחומי
          המוטוריקה הגסה והעדינה, הקואורדינציה, הבצוע הגרפו-מוטורי, הוויסות
          התחושתי, התכלול הבין-חושי, התפיסה החזותית והמרחבית, הקוגניציה, הריכוז,
          ההתארגנות, התפקוד במטלות יום-יומיות (ADL) בבית ובבית-הספר, הדרכת הורים
          ועוד.
        </li>
        <li className="mb-2">
          קלינאות תקשורת התפתחותית לילדים: אבחון וטיפול באחור ועיכוב בהתפתחות
          השפה והתקשורת, בקשיי הגוי, בגמגום, בתפיסה השמיעתית, במודעות
          הפונולוגית, בשימוש התקשורתי בשפה ועוד. הטיפול ניתן בשיתוף ההורים וכולל
          הדרכה, הנחייה ומתן תרגילים הביתה.
        </li>
      </ul>
    </PageLayout>
  );
}
