import React, { Component } from "react";
import Card from "react-bootstrap/Card";
import menuLogo from "../Images/menu.png";
class About extends Component {
  render() {
    return (
      <div>
        <Card className="text-center">
          <Card.Header className="text-right">
            {" "}
            <button
              onClick={() =>
                this.props.onSetSidebarOpen(!this.props.sidebarDocked)
              }
            >
              <img src={menuLogo} />
            </button>
            מ.י.ת.ר המכון הישראלי לתראפיות
          </Card.Header>
          <Card.Body>
            <Card.Title>
            אודות מכון מ.י.ת.ר.
            </Card.Title>
            <Card.Text>
            מי אנחנו ?

מרכז מ.י.ת.ר. הנו מכון רב תחומי ליעוץ וטיפול במבוגרים, מתבגרים וילדים המתמודדים עם קשיי הסתגלות ותפקוד שונים בחייהם: קשיים רגשיים, נפשיים והתנהגותיים, קשיי התפתחות, בעיות התנהגות בבית ובבית-הספר, קשיי למידה, קשב וריכוז, קושי ביצירה ו/או בניהול של קשרים בין-אישיים, קשיים בהורות ו/או בזוגיות,  התמודדות עם מצבי לחץ, חרדה ודכאון, התמודדות עם גירושין, אבדן ושכול, טראומות נפשיות, ועוד.

הטיפול מותאם אישית לכל מטופל על-פי צרכיו ומתבצע ע"י אנשי מקצוע מוסמכים ומנוסים, במגוון שיטות טיפוליות.

צוות רב-מקצועי
ב מ.י.ת.ר. צוות רב-מקצועי בעל הכשרה רחבה, ניסיון רב וברישיון של משרד הבריאות. בראש הצוות עומדות המנהלות המקצועיות, גבי גרזי וביאטריס גונן.

גבי גרזי - פסיכותיראפיסטית, עובדת סוציאלית קלינית ומדריכה בעלת ותק של 37 שנים בטיפול בילדים, הורים ומבוגרים.

ביאטריס גונן - פסיכותיראפיסטית, מטפלת באמצעות אומנות ומדריכה, בעלת ותק של 25 שנים בטיפול בילדים ומבוגרים ובהנחיית קבוצות.

מרכז מ.י.ת.ר. הנו מכון פרטי המתחייב לחסיון רפואי מלא בכל הקשור לפרטי המטופל והטפול.

מטופלים בעלי ביטוח דרך חברות ביטוח או בטוח משלמים של קופות החולים יכולים לקבל את הטיפול באמצעות ביטוחים אלה.

סניפים:
קריית ביאליק, שדרות בן גוריון 63 קומה 6.
            </Card.Text>
          </Card.Body>
        </Card>
      </div>
    );
  }
}

export default About;
