import React, { Component } from "react";
import Card from "react-bootstrap/Card";
import menuLogo from "../Images/menu.png";
class Fields extends Component {
  render() {
    return (
      <div>
        <Card className="text-center">
          <Card.Header className="text-right">
            {" "}
            <button
              onClick={() =>
                this.props.onSetSidebarOpen(!this.props.sidebarDocked)
              }
            >
              <img src={menuLogo} />
            </button>
            מ.י.ת.ר המכון הישראלי לתראפיות
          </Card.Header>
          <Card.Body>
            <Card.Title>
            תחומי הטיפול במכון
            </Card.Title>
            <Card.Text>
            טיפול רגשי במבוגרים וילדים - פסיכותיראפיה פרטנית, זוגית, משפחתית, דיאדית וקבוצתית ע"י מגוון אנשי מקצוע מתחום בריאות הנפש: פסיכולוגים, עובדים סוציאליים - פסיכותיראפיסטים ותיראפיסטים באמצעות יצירה והבעה.
אבחון פסיכולוגי לילדים.
הדרכת הורים: במקביל לטיפול הריגשי בילדים ובמתבגרים.
טיפולים בהבעה ויצירה (אומנות, דרמה, תנועה, ביבליותרפיה).
תחומי טיפול נוספים בתחום הרגישי (פסיכותיראפיה, טיפול במשחק, טיפול דיאדי, טיפול משפחתי, טיפול קבוצתי).
ריפוי בעיסוק התפתחותי לילדים: אבחון וטיפול בקשיים התפתחותיים בתחומי המוטוריקה הגסה והעדינה, הקואורדינציה, הבצוע הגרפו-מוטורי, הוויסות התחושתי, התכלול הבין-חושי, התפיסה החזותית והמרחבית, הקוגניציה, הריכוז, ההתארגנות, התפקוד במטלות יום-יומיות (ADL) בבית ובבית-הספר, הדרכת הורים ועוד.
קלינאות תקשורת התפתחותית לילדים: אבחון וטיפול באחור ועיכוב בהתפתחות השפה והתקשורת, בקשיי הגוי, בגמגום, בתפיסה השמיעתית, במודעות הפונולוגית, בשימוש התקשורתי בשפה ועוד. הטיפול ניתן בשיתוף ההורים וכולל הדרכה, הנחייה ומתן תרגילים הביתה.
            </Card.Text>
          </Card.Body>
        </Card>
      </div>
    );
  }
}

export default Fields;
